using System.Collections.Generic;
using System.Drawing;
using 游戏服务器.地图类;

namespace 游戏服务器.副本类;

// 借鉴移植(参考引擎): 魔渊派对/分级Boss房。分波刷杂兵→诅咒之棺→按随机数出青铜/白银/黄金魔王。
// 运行时需: 魔渊派对地图/区域"魔渊派对刷怪区域"/怪物模板(邪骸精兵01·邪骸影射01·匍匐僵尸01·干枯僵尸01·诅咒之棺02·魔王青铜/白银/黄金)/Lua scene_instance_run 指向本类.执行。
public static class 魔源裂隙2
{
	private static readonly Dictionary<int, string[]> 魔渊之地怪物刷新 = new Dictionary<int, string[]> { [1] = new string[3] { "妖僧 弘化", "妖僧 清远", "妖僧 弘深" } };

	public static int 次数;

	public static void 执行(地图实例 地图)
	{
		if (!(主程.当前时间 > 地图.节点计时))
		{
			return;
		}
		if (地图.玩家列表.Count == 0)
		{
			地图.副本节点 = 255;
		}
		if (地图.副本节点 == 255)
		{
			地图.关闭副本();
		}
		else if (地图.副本节点 == 0)
		{
			地图.副本节点 = 1;
			地图.节点计时 = 主程.当前时间.AddSeconds(2.0);
		}
		else if (地图.副本节点 == 1)
		{
			地图.地图公告("怪物即将出现");
			地图.副本节点 = 2;
			地图.节点计时 = 主程.当前时间.AddSeconds(3.0);
		}
		else if (地图.副本节点 == 2)
		{
			地图.节点计时 = 主程.当前时间.AddSeconds(1.0);
			Point[][] array = new Point[1][] { 地图.获取怪物区域("魔渊派对刷怪区域").获取刷新范围() };
			副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("邪骸影射01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			副本.范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, array[0], 禁止复活: true, 立即刷新: true);
			地图.副本节点++;
		}
		else if (地图.副本节点 == 3)
		{
			if (地图.存活怪物总数 == 0)
			{
				副本.范围刷新怪物从地图实例("诅咒之棺02", 地图, 0, new Point(1021, 117), 禁止复活: true, 立即刷新: true);
				地图.副本节点++;
			}
		}
		else if (地图.副本节点 == 4)
		{
			if (地图.存活怪物总数 == 0)
			{
				int num = 主程.随机数.Next(10);
				Point[][] array2 = new Point[1][] { 地图.获取怪物区域("魔渊派对刷怪区域").获取刷新范围() };
				if (num > 9)
				{
					副本.范围刷新怪物从地图实例("魔王黄金", 地图, 0, array2[0], 禁止复活: true, 立即刷新: true);
					副本.范围刷新怪物从地图实例("魔王黄金", 地图, 0, array2[0], 禁止复活: true, 立即刷新: true);
					副本.范围刷新怪物从地图实例("魔王黄金", 地图, 0, array2[0], 禁止复活: true, 立即刷新: true);
					地图.副本节点++;
				}
				else if (num >= 8)
				{
					副本.范围刷新怪物从地图实例("魔王白银", 地图, 0, array2[0], 禁止复活: true, 立即刷新: true);
					副本.范围刷新怪物从地图实例("魔王白银", 地图, 0, array2[0], 禁止复活: true, 立即刷新: true);
					地图.副本节点++;
				}
				else if (num >= 1)
				{
					副本.范围刷新怪物从地图实例("魔王青铜", 地图, 0, array2[0], 禁止复活: true, 立即刷新: true);
					地图.副本节点++;
				}
			}
		}
		else if (地图.副本节点 >= 5 && 地图.存活怪物总数 == 0)
		{
			地图.地图公告("深渊怪物被击杀，副本即将关闭");
			地图.节点计时 = 主程.当前时间.AddSeconds(10.0);
			地图.副本节点 = 255;
		}
	}
}
