using System;
using System.Collections.Generic;
using System.Drawing;
using System.IO;
using System.Linq;
using System.Threading.Tasks;
using _001D_000F_0007_0013_0011_0015;
using 游戏服务器;
using 游戏服务器.地图类;
using 游戏服务器.网络类;
using AStar;
using AStarPathing;

namespace AutoBattle
{
	internal class AutoBattleManager
	{
		private static Dictionary<int, Grid> 地图导航网格 = new Dictionary<int, Grid>();

		private static Dictionary<string, AStarSearch> 玩家寻路网格 = new Dictionary<string, AStarSearch>();

		private static readonly int PriorityDist = 3;

		public static void Start()
		{
			Task.Run( async () =>
			{
				await AutoBattleManager._0007_0006_0003_000C_0005_0014();
			});
		}

		private static async Task _0007_0006_0003_000C_0005_0014()
		{
			while (主程.已经启动 || 网络服务网关.网络连接表.Count != 0 || 主程.主线程 != null)
			{
				try
				{
					if (Settings.开启自动战斗)
					{
						foreach (玩家实例 player in 地图处理网关.玩家对象表.Values.ToList())
						{
							if (player.自动挂机 == null || !player.自动挂机.自动战斗 || player.当前地图.地图编号 != player.挂机_地图)
							{
								continue;
							}
							switch (player.挂机_状态)
							{
							case 挂机状态.寻路:
								AutoBattleManager._0001_0006_0002_0007_0008_0001_0001_0007_0009_0002(player, (player?.挂机_目标?.对象死亡 ?? true) ? null : player.挂机_目标);
								break;
							case 挂机状态.移动中:
								if (player.自动挂机 == null || !player.自动挂机.自动战斗 || player.当前地图.地图编号 != player.挂机_地图 || player.邻居列表.Count == 0)
								{
									break;
								}
								foreach (地图对象 item in from i in player.邻居列表.ToList()
									orderby 计算类.网格距离(i?.当前坐标 ?? default(Point), player.当前坐标)
									select i)
								{
									if (item == null)
									{
										continue;
									}
									if (item.对象类型 == 游戏对象类型.物品)
									{
										if (!item.IsMoney())
										{
											开始自动战斗 自动挂机;
											自动挂机 = player.自动挂机;
											if (自动挂机 == null || !自动挂机.开启自动拾取 || player.背包重量 >= player[游戏对象属性.最大负重] || player.背包剩余 == 0 || ((player.自动挂机?.开启预留背包 ?? false) && player.背包剩余 <= (player.自动挂机?.预留格数 ?? 0)))
											{
												continue;
											}
										}
										物品实例 物品实例;
										物品实例 = item as 物品实例;
										if (!player.物品过滤.Contains(物品实例.物品编号))
										{
											continue;
										}
										if (player.自动挂机?.不捡取他人装备 ?? false)
										{
											if (物品实例.物品归属.Count > 0 && 物品实例.归属时间 != default(DateTime) && !物品实例.物品归属.Contains(player.角色数据) && 主程.当前时间 < 物品实例.归属时间)
											{
												continue;
											}
										}
										else if (物品实例.物品归属.Count > 0 && 物品实例.归属时间 != default(DateTime) && !物品实例.物品归属.Contains(player.角色数据) && 主程.当前时间 < 物品实例.归属时间)
										{
											continue;
										}
										player.挂机_目标 = item;
										player.挂机_状态 = 挂机状态.寻路;
										break;
									}
									if (item.对象类型 == 游戏对象类型.怪物 && !item.对象死亡)
									{
										怪物实例 怪物实例;
										怪物实例 = item as 怪物实例;
										if (!player.自动挂机.不抢怪 || 怪物实例.对象仇恨.当前目标 == null || 怪物实例.对象仇恨.当前目标 == player || player.宠物列表.Contains(怪物实例.对象仇恨.当前目标))
										{
											player.挂机_目标 = 怪物实例;
											player.挂机_状态 = 挂机状态.寻路;
											break;
										}
									}
								}
								break;
							}
						}
					}
					await Task.Delay(1);
				}
				catch (Exception ex)
				{
					File.AppendAllText(Path.Combine(Environment.CurrentDirectory, "内挂线程异常.txt"), DateTime.Now.ToString() + " -> " + ex.ToString() + "\r\n");
				}
			}
		}

		private static void _0001_0006_0002_0007_0008_0001_0001_0007_0009_0002(玩家实例 _0002_0003_0005_0003_0002_0005_000A_0006, 地图对象 _0009_0003_0003_0004_0002_000E = null)
		{
			if (_0002_0003_0005_0003_0002_0005_000A_0006.自动挂机 == null || !_0002_0003_0005_0003_0002_0005_000A_0006.自动挂机.自动战斗)
			{
				return;
			}
			_0002_0003_0005_0003_0002_0005_000A_0006.挂机_寻路队列.Clear();
			Rectangle 挂机_范围;
			挂机_范围 = _0002_0003_0005_0003_0002_0005_000A_0006.挂机_范围;
			Dictionary<地图对象, bool> dictionary;
			dictionary = ((_0009_0003_0003_0004_0002_000E != null) ? new Dictionary<地图对象, bool> { 
			{
				_0009_0003_0003_0004_0002_000E,
				计算类.网格距离(_0009_0003_0003_0004_0002_000E.当前坐标, _0002_0003_0005_0003_0002_0005_000A_0006.当前坐标) < AutoBattleManager.PriorityDist
			} } : new Dictionary<地图对象, bool>());
			if (!dictionary.Any() && _0002_0003_0005_0003_0002_0005_000A_0006 != null && _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机 != null)
			{
				byte 拾取范围;
				拾取范围 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机.拾取范围;
				Rectangle rectangle;
				rectangle = new Rectangle(_0002_0003_0005_0003_0002_0005_000A_0006.当前坐标.X - 拾取范围, _0002_0003_0005_0003_0002_0005_000A_0006.当前坐标.Y - 拾取范围, 拾取范围 * 2, 拾取范围 * 2);
				Dictionary<地图对象, int> 邻居表;
				邻居表 = (from l in _0002_0003_0005_0003_0002_0005_000A_0006.邻居列表.ToList()
					where l != null
					orderby 计算类.网格距离(_0002_0003_0005_0003_0002_0005_000A_0006.当前坐标, l.当前坐标)
					select l).ToDictionary((地图对象 k) => k, (地图对象 v) => 计算类.网格距离(v.当前坐标, _0002_0003_0005_0003_0002_0005_000A_0006.当前坐标));
				foreach (KeyValuePair<地图对象, int> item in 邻居表)
				{
					if (_0002_0003_0005_0003_0002_0005_000A_0006.自动挂机 == null || !_0002_0003_0005_0003_0002_0005_000A_0006.自动挂机.自动战斗)
					{
						return;
					}
					地图对象 key;
					key = item.Key;
					int value;
					value = item.Value;
					if (key != null && (key.对象类型 == 游戏对象类型.物品 || key.对象名字 != null))
					{
						if (key.对象类型 == 游戏对象类型.怪物 && value >= 5)
						{
							游戏对象职业 角色职业;
							角色职业 = _0002_0003_0005_0003_0002_0005_000A_0006.角色职业;
							if (角色职业 == 游戏对象职业.法师 || (uint)(角色职业 - 3) <= 1u)
							{
								continue;
							}
						}
						if (_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标_黑名单.TryGetValue(key, out var value2))
						{
							if (主程.当前时间 < value2)
							{
								continue;
							}
							_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标_黑名单.TryRemove(key, out var _);
						}
						游戏对象类型 对象类型;
						对象类型 = key.对象类型;
						if (对象类型 != 游戏对象类型.怪物)
						{
							if (对象类型 != 游戏对象类型.物品)
							{
								continue;
							}
							bool flag;
							if (!(flag = key.IsMoney()))
							{
								if (_0002_0003_0005_0003_0002_0005_000A_0006.背包重量 >= _0002_0003_0005_0003_0002_0005_000A_0006[游戏对象属性.最大负重] || _0002_0003_0005_0003_0002_0005_000A_0006.背包剩余 == 0)
								{
									continue;
								}
								开始自动战斗 自动挂机;
								自动挂机 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机;
								if (自动挂机 == null || !自动挂机.开启自动拾取 || !rectangle.Contains(key?.当前坐标 ?? default(Point)))
								{
									continue;
								}
								开始自动战斗 自动挂机2;
								自动挂机2 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机;
								if (自动挂机2 != null && 自动挂机2.开启预留背包 && _0002_0003_0005_0003_0002_0005_000A_0006.背包剩余 <= (_0002_0003_0005_0003_0002_0005_000A_0006.自动挂机?.预留格数 ?? 0))
								{
									continue;
								}
							}
							if (_0002_0003_0005_0003_0002_0005_000A_0006.当前地图[key?.当前坐标 ?? default(Point)].Any((地图对象 o) => o.阻塞网格))
							{
								continue;
							}
							物品实例 物品实例;
							物品实例 = null;
							开始自动战斗 自动挂机3;
							自动挂机3 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机;
							if (自动挂机3 != null && 自动挂机3.不捡取他人装备)
							{
								物品实例 = key as 物品实例;
								if (物品实例.物品归属.Count > 0 && 物品实例.归属时间 != default(DateTime) && !物品实例.物品归属.Contains(_0002_0003_0005_0003_0002_0005_000A_0006.角色数据) && 主程.当前时间 < 物品实例.归属时间)
								{
									continue;
								}
							}
							if (!flag && !_0002_0003_0005_0003_0002_0005_000A_0006.物品过滤.Contains((物品实例 ?? (key as 物品实例)).物品编号))
							{
								continue;
							}
						}
						else
						{
							if (value == 0)
							{
								continue;
							}
							怪物实例 怪物;
							怪物 = key as 怪物实例;
							if (怪物.对象死亡)
							{
								continue;
							}
							开始自动战斗 自动挂机4;
							自动挂机4 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机;
							if (自动挂机4 != null && 自动挂机4.不抢怪 && 怪物.对象仇恨.当前目标 != null && 怪物.对象仇恨.当前目标 != _0002_0003_0005_0003_0002_0005_000A_0006 && !_0002_0003_0005_0003_0002_0005_000A_0006.宠物列表.Any((宠物实例 c) => 怪物.对象仇恨.当前目标 == c))
							{
								continue;
							}
						}
						开始自动战斗 自动挂机5;
						自动挂机5 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机;
						if ((自动挂机5 != null && 自动挂机5.开启自动拾取) || key == null || key.对象类型 != 游戏对象类型.物品)
						{
							dictionary.Add(key, value < AutoBattleManager.PriorityDist);
						}
					}
					else
					{
						主程.添加系统日志("邻居异常");
					}
				}
				dictionary = dictionary.OrderByDescending(delegate(KeyValuePair<地图对象, bool> d)
				{
					开始自动战斗 自动挂机7;
					自动挂机7 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机;
					return (自动挂机7 == null || !自动挂机7.优先战斗) ? (d.Key.对象类型 == 游戏对象类型.物品) : (d.Key.对象类型 == 游戏对象类型.怪物);
				}).ThenByDescending((KeyValuePair<地图对象, bool> d) => d.Value).ThenByDescending(delegate(KeyValuePair<地图对象, bool> d)
				{
					if (d.Key.对象类型 != 游戏对象类型.怪物)
					{
						开始自动战斗 自动挂机6;
						自动挂机6 = _0002_0003_0005_0003_0002_0005_000A_0006.自动挂机;
						if (自动挂机6 != null && 自动挂机6.优先拾取极品道具)
						{
							return _0002_0003_0005_0003_0002_0005_000A_0006.物品极品提示.Contains((d.Key as 物品实例).物品编号);
						}
						return false;
					}
					return true;
				})
					.ThenBy((KeyValuePair<地图对象, bool> d) => (d.Key.对象类型 != 游戏对象类型.物品) ? DateTime.MaxValue : (d.Key as 物品实例).归属时间)
					.ThenBy((KeyValuePair<地图对象, bool> d) => 邻居表[d.Key])
					.ToDictionary( (KeyValuePair<地图对象, bool> k) => k.Key, (KeyValuePair<地图对象, bool> v) => v.Value);
			}
			while (true)
			{
				if (_0002_0003_0005_0003_0002_0005_000A_0006.挂机_寻路队列.Count == 0)
				{
					_0009_0003_0003_0004_0002_000E = dictionary.FirstOrDefault().Key;
					Random 随机数;
					随机数 = 主程.随机数;
					Point 坐标;
					坐标 = _0009_0003_0003_0004_0002_000E?.当前坐标 ?? new Point(随机数.Next(挂机_范围.Left, 挂机_范围.Right), 随机数.Next(挂机_范围.Top, 挂机_范围.Bottom));
					int num;
					num = 0;
					while (_0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地形阻塞(坐标))
					{
						if (_0002_0003_0005_0003_0002_0005_000A_0006.自动挂机 != null && !_0002_0003_0005_0003_0002_0005_000A_0006.自动挂机.自动战斗 && _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图编号 == _0002_0003_0005_0003_0002_0005_000A_0006.挂机_地图 && 地图处理网关.玩家对象表.ContainsKey(_0002_0003_0005_0003_0002_0005_000A_0006.地图编号))
						{
							坐标 = new Point(随机数.Next(挂机_范围.Left, 挂机_范围.Right), 随机数.Next(挂机_范围.Top, 挂机_范围.Bottom));
							num++;
							if (num > (_0002_0003_0005_0003_0002_0005_000A_0006?.自动挂机?.战斗范围 ?? 10) * 10)
							{
								return;
							}
							continue;
						}
						return;
					}
					if (_0009_0003_0003_0004_0002_000E != null)
					{
						if (_0009_0003_0003_0004_0002_000E.对象类型 == 游戏对象类型.怪物)
						{
							int num2;
							num2 = 计算类.网格距离(_0009_0003_0003_0004_0002_000E.当前坐标, _0002_0003_0005_0003_0002_0005_000A_0006.当前坐标);
							switch (_0002_0003_0005_0003_0002_0005_000A_0006.角色职业)
							{
							case 游戏对象职业.法师:
							case 游戏对象职业.弓手:
							case 游戏对象职业.道士:
								if (num2 <= 5 && _0002_0003_0005_0003_0002_0005_000A_0006.获取远攻技能数() > 1 && (_0002_0003_0005_0003_0002_0005_000A_0006.当前魔力 > 30 || num2 == 1))
								{
									_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标 = _0009_0003_0003_0004_0002_000E;
									_0002_0003_0005_0003_0002_0005_000A_0006.挂机_状态 = 挂机状态.战斗中;
									AutoBattleManager._0012_000E_000F_0008_0003_0014(_0002_0003_0005_0003_0002_0005_000A_0006);
									return;
								}
								break;
							case 游戏对象职业.战士:
							case 游戏对象职业.刺客:
							case 游戏对象职业.龙枪:
								if (num2 == 1)
								{
									_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标 = _0009_0003_0003_0004_0002_000E;
									_0002_0003_0005_0003_0002_0005_000A_0006.挂机_状态 = 挂机状态.战斗中;
									AutoBattleManager._0012_000E_000F_0008_0003_0014(_0002_0003_0005_0003_0002_0005_000A_0006);
									return;
								}
								break;
							}
						}
						else if (_0009_0003_0003_0004_0002_000E.对象类型 == 游戏对象类型.物品 && _0002_0003_0005_0003_0002_0005_000A_0006.当前坐标 == _0009_0003_0003_0004_0002_000E.当前坐标)
						{
							_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标 = _0009_0003_0003_0004_0002_000E;
							_0002_0003_0005_0003_0002_0005_000A_0006.挂机_状态 = 挂机状态.等待拾取;
							AutoBattleManager._0012_000E_000F_0008_0003_0014(_0002_0003_0005_0003_0002_0005_000A_0006);
							break;
						}
					}
					Grid value3;
					value3 = null;
					if (!AutoBattleManager.地图导航网格.TryGetValue(_0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图编号, out value3))
					{
						value3 = new Grid(_0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图大小.X, _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图大小.Y, _Blocked: true);
						AutoBattleManager.地图导航网格.Add(_0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图编号, value3);
					}
					if (!AutoBattleManager.玩家寻路网格.TryGetValue(_0002_0003_0005_0003_0002_0005_000A_0006.对象名字, out var value4))
					{
						value4 = new AStarSearch(value3);
						AutoBattleManager.玩家寻路网格.Add(_0002_0003_0005_0003_0002_0005_000A_0006.对象名字, value4);
					}
					else if (!value4.SameGrid(value3))
					{
						AutoBattleManager.玩家寻路网格[_0002_0003_0005_0003_0002_0005_000A_0006.对象名字] = new AStarSearch(value3);
					}
					for (int i = 0; i < value3.Width; i++)
					{
						for (int j = 0; j < value3.Height; j++)
						{
							value3[i, j].Blocked = !_0002_0003_0005_0003_0002_0005_000A_0006.当前地图.能否通行(new Point(i + _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.X, j + _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.Y));
						}
					}
					Cell cell;
					cell = value3[坐标.X - _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.X, 坐标.Y - _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.Y];
					if (cell != null)
					{
						cell.Blocked = false;
					}
					Vector2Int start;
					start = new Vector2Int(_0002_0003_0005_0003_0002_0005_000A_0006.当前坐标.X - _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.X, _0002_0003_0005_0003_0002_0005_000A_0006.当前坐标.Y - _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.Y);
					Vector2Int goal;
					goal = new Vector2Int(坐标.X - _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.X, 坐标.Y - _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.Y);
					Cell[] array;
					array = value4.Find(start, goal);
					if (array == null)
					{
						if (_0009_0003_0003_0004_0002_000E != null)
						{
							dictionary.Remove(_0009_0003_0003_0004_0002_000E);
						}
						continue;
					}
					if (array.Length <= 1 && _0009_0003_0003_0004_0002_000E != null && _0009_0003_0003_0004_0002_000E.对象类型 == 游戏对象类型.物品)
					{
						if (_0009_0003_0003_0004_0002_000E != null)
						{
							dictionary.Remove(_0009_0003_0003_0004_0002_000E);
						}
						continue;
					}
					for (int m = 1; m < array.Length; m++)
					{
						_0002_0003_0005_0003_0002_0005_000A_0006.挂机_寻路队列.Enqueue(new Point(array[m].Location.X + _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.X, array[m].Location.Y + _0002_0003_0005_0003_0002_0005_000A_0006.当前地图.地图起点.Y));
					}
					Cell[] array2;
					array2 = array;
					for (int n = 0; n < array2.Length; n++)
					{
						array2[n].Parent = null;
					}
					_0002_0003_0005_0003_0002_0005_000A_0006.挂机_状态 = 挂机状态.移动中;
				}
				_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标 = ((_0002_0003_0005_0003_0002_0005_000A_0006.挂机_寻路队列.Count > 0) ? _0009_0003_0003_0004_0002_000E : null);
				AutoBattleManager._0012_000E_000F_0008_0003_0014(_0002_0003_0005_0003_0002_0005_000A_0006);
				break;
			}
		}

		private static void _0012_000E_000F_0008_0003_0014(玩家实例 _0002_0003_0005_0003_0002_0005_000A_0006)
		{
			if (_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标 != null)
			{
				if (_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标.对象类型 == 游戏对象类型.物品)
				{
					_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标_超时时间 = 主程.当前时间.AddSeconds(120.0);
				}
				else if (_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标.对象类型 == 游戏对象类型.怪物)
				{
					_0002_0003_0005_0003_0002_0005_000A_0006.挂机_目标_超时时间 = 主程.当前时间.AddSeconds(120.0);
				}
			}
		}
	}
}
